---
title: ClosestPointsPairBetweenTwoCurves
classe: Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ClosestPointsPairBetweenTwoCurves

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Distance { get; set; }` | `closestPointsPairBetweenTwoCurves.Distance` | Double |
| `Boolean IsValidObject { get; }` | `closestPointsPairBetweenTwoCurves.IsValidObject` | Boolean |
| `Double ParameterOnFirstCurve { get; set; }` | `closestPointsPairBetweenTwoCurves.ParameterOnFirstCurve` | Double |
| `Double ParameterOnSecondCurve { get; set; }` | `closestPointsPairBetweenTwoCurves.ParameterOnSecondCurve` | Double |
| `XYZ XYZPointOnFirstCurve { get; set; }` | `closestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve` | XYZ |
| `XYZ XYZPointOnSecondCurve { get; set; }` | `closestPointsPairBetweenTwoCurves.XYZPointOnSecondCurve` | XYZ |
| `Void Dispose()` | `closestPointsPairBetweenTwoCurves.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```